app/controllers/denuncias_transitos_controller.rb

  def index
    @denuncias_transitos = DenunciasTransito.all
---
SELECT "denuncias_transitos".* FROM "denuncias_transitos"

  def show
    @denuncias_transito = DenunciasTransito.find(params[:id])
---
SELECT "denuncias_transitos".* FROM "denuncias_transitos" WHERE "denuncias_transitos"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @denuncias_transito = DenunciasTransito.find(params[:id])
---
SELECT "denuncias_transitos".* FROM "denuncias_transitos" WHERE "denuncias_transitos"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @denuncias_transito = DenunciasTransito.new(params[:denuncias_transito])

    respond_to do |format|
      if @denuncias_transito.save
---
INSERT INTO "denuncias_transitos" ("apMaterno", "apPaterno", "created_at", "descripcion", "fecha", "hora", "lugarHecho", "municipio", "numOficial", "numPatrulla", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @denuncias_transito = DenunciasTransito.find(params[:id])
---
SELECT "denuncias_transitos".* FROM "denuncias_transitos" WHERE "denuncias_transitos"."id" = ? LIMIT 1  [["id", "4"]]

  def destroy
    @denuncias_transito = DenunciasTransito.find(params[:id])
    @denuncias_transito.destroy
---
SELECT "denuncias_transitos".* FROM "denuncias_transitos" WHERE "denuncias_transitos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "denuncias_transitos" WHERE "denuncias_transitos"."id" = ?  [["id", 1]]